{
  "users": [
    {
      "email": "dario@ciao.com",
      "password": "$2a$10$D2uHZHnHXNDgf533hNz2oOOTieMB2ROk0e5WUjOTbbmRP2ATLpEMG",
      "name": "Dario",
      "id": 1
    },
    {
      "email": "dario03juve@gmail.com",
      "password": "$2a$10$SnxeTc3RBNC1Cie3aBuftuDBIjpGKSFdLODSoRUSBvvteaN17c0va",
      "name": "Dario",
      "id": 2
    },
    {
      "email": "dwadad@dadwa.it",
      "password": "$2a$10$3taUkP5SAtq9yfKsPkmGZeNlnA1co6UIu.yoqgFqaGHiBRPF./jrO",
      "name": "dwadad",
      "id": 3
    }
  ],
  "movies-popular": [
    {
      "id": 1,
      "title": "Inception",
      "year": 2010,
      "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
      ],
      "plot": "Dom Cobb è un ladro esperto in estrazione di informazioni dal subconscio durante i sogni. Viene incaricato di compiere l'opposto: l'inserimento di un'idea nel subconscio di una persona. Il film esplora il concetto di realtà e sogno.",
      "image": "https://picsum.photos/id/1015/200/300"
    },
    {
      "id": 2,
      "title": "The Shawshank Redemption",
      "year": 1994,
      "genres": [
        "Drama"
      ],
      "plot": "Un banchiere condannato ingiustamente per l'omicidio della moglie e del suo amante si sforza di mantenere la speranza e la dignità mentre trascorre decenni in una prigione.",
      "image": "https://picsum.photos/id/1016/200/300"
    },
    {
      "id": 3,
      "title": "Forrest Gump",
      "year": 1994,
      "genres": [
        "Drama",
        "Romance"
      ],
      "plot": "Forrest Gump è un uomo con un quoziente intellettivo al di sotto della media che si trova coinvolto in importanti eventi storici degli Stati Uniti. La storia segue la sua vita straordinaria e il suo amore per Jenny.",
      "image": "https://picsum.photos/id/1018/200/300"
    },
    {
      "id": 4,
      "title": "The Godfather",
      "year": 1972,
      "genres": [
        "Crime",
        "Drama"
      ],
      "plot": "Il Padrino racconta la storia di una famiglia mafiosa italo-americana guidata dal patriarca Vito Corleone. Il film esplora il mondo della criminalità organizzata e il conflitto tra la famiglia Corleone e le altre famiglie mafiose di New York.",
      "image": "https://picsum.photos/id/1021/200/300"
    },
    {
      "id": 5,
      "title": "Pulp Fiction",
      "year": 1994,
      "genres": [
        "Crime",
        "Drama"
      ],
      "plot": "Pulp Fiction è una raccolta di storie interconnesse che ruotano attorno al mondo del crimine a Los Angeles. Il film segue le vicende di gangster, pugili, ballerine e altri personaggi che si intrecciano in modo imprevedibile.",
      "image": "https://picsum.photos/id/1022/200/300"
    },
    {
      "id": 6,
      "title": "The Dark Knight",
      "year": 2008,
      "genres": [
        "Action",
        "Crime",
        "Drama"
      ],
      "plot": "Batman deve affrontare il suo acerrimo nemico, il Joker, che semina caos e distruzione a Gotham City. Il film esplora temi di giustizia, moralità e identità.",
      "image": "https://picsum.photos/id/1023/200/300"
    },
    {
      "id": 7,
      "title": "Schindler's List",
      "year": 1993,
      "genres": [
        "Biography",
        "Drama",
        "History"
      ],
      "plot": "La vera storia di Oskar Schindler, un uomo d'affari tedesco che ha salvato la vita di più di mille ebrei durante l'Olocausto, assumendoli come lavoratori nella sua fabbrica.",
      "image": "https://picsum.photos/id/1024/200/300"
    },
    {
      "id": 8,
      "title": "Interstellar",
      "year": 2014,
      "genres": [
        "Adventure",
        "Drama",
        "Sci-Fi"
      ],
      "plot": "In un futuro in cui la Terra è diventata inabitabile, un gruppo di astronauti parte per un viaggio interstellare alla ricerca di un nuovo pianeta abitabile per l'umanità. Il film esplora temi come il tempo, lo spazio e l'amore.",
      "image": "https://picsum.photos/id/1025/200/300"
    },
    {
      "id": 9,
      "title": "Fight Club",
      "year": 1999,
      "genres": [
        "Drama"
      ],
      "plot": "Un uomo insoddisfatto della sua vita incontra un vendicativo venditore di sapone e insieme fondano il Fight Club, un gruppo segreto dove uomini combattono tra loro. Il film esplora il consumismo e la ricerca di significato nella società moderna.",
      "image": "https://picsum.photos/id/1026/200/300"
    },
    {
      "id": 10,
      "title": "The Matrix",
      "year": 1999,
      "genres": [
        "Action",
        "Sci-Fi"
      ],
      "plot": "Un programmatore informatico scopre che il mondo in cui vive è solo un'illusione creata da una razza di macchine intelligenti. Si unisce a una ribellione per liberare l'umanità dalla schiavitù delle macchine.",
      "image": "https://picsum.photos/id/1027/200/300"
    }
  ],
  "favorites": []
}